Revit 2027 API
KeyBasedTreeEntriesIterator.Current Property
Gets the item at the current position of the iterator.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public virtual KeyBasedTreeEntry Current { get; }
Public Overridable ReadOnly Property Current As KeyBasedTreeEntry
	Get
public:
virtual property KeyBasedTreeEntry^ Current {
	KeyBasedTreeEntry^ get ();
}
abstract Current : KeyBasedTreeEntry with get
override Current : KeyBasedTreeEntry with get
Property Value
KeyBasedTreeEntry
Implements
IEnumerator<T>.Current
Exceptions
Exception | Condition
InvalidOperationException |  There is no current item in the iterator.
Remarks
There is no current item if the iterator has not started yet or has been done.
See Also
Reference
KeyBasedTreeEntriesIterator Class
Autodesk.Revit.DB Namespace